MCUdude/MiniCore/avr/boards.txt
48.menu.clock.12MHz_external=External 12 MHz
48.menu.clock.12MHz_external.upload.speed=57600
48.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.12MHz_external.build.clkpr=
48.menu.clock.12MHz_external.build.f_cpu=12000000L

48.menu.clock.11_0592MHz_external=External 11.0592 MHz
48.menu.clock.11_0592MHz_external.upload.speed=115200
48.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.11_0592MHz_external.build.clkpr=
48.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

48.menu.clock.8MHz_external=External 8 MHz
48.menu.clock.8MHz_external.upload.speed=57600
48.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.8MHz_external.build.clkpr=
48.menu.clock.8MHz_external.build.f_cpu=8000000L

48.menu.clock.7_3728MHz_external=External 7.3728 MHz
48.menu.clock.7_3728MHz_external.upload.speed=115200
48.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.7_3728MHz_external.build.clkpr=
48.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

48.menu.clock.4MHz_external=External 4 MHz
48.menu.clock.4MHz_external.upload.speed=9600
48.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.4MHz_external.build.clkpr=
48.menu.clock.4MHz_external.build.f_cpu=4000000L

48.menu.clock.3_6864MHz_external=External 3.6864 MHz
48.menu.clock.3_6864MHz_external.upload.speed=115200
48.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.3_6864MHz_external.build.clkpr=
48.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

48.menu.clock.2MHz_external=External 2 MHz
48.menu.clock.2MHz_external.upload.speed=9600
48.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.2MHz_external.build.clkpr=
48.menu.clock.2MHz_external.build.f_cpu=2000000L

48.menu.clock.1_8432MHz_external=External 1.8432 MHz
48.menu.clock.1_8432MHz_external.upload.speed=115200
48.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.1_8432MHz_external.build.clkpr=
48.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

48.menu.clock.1MHz_external=External 1 MHz
48.menu.clock.1MHz_external.upload.speed=9600
48.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.1MHz_external.build.clkpr=
48.menu.clock.1MHz_external.build.f_cpu=1000000L

48.menu.clock.8MHz_internal=Internal 8 MHz
48.menu.clock.8MHz_internal.upload.speed=38400
48.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.8MHz_internal.build.clkpr=
48.menu.clock.8MHz_internal.build.f_cpu=8000000L

48.menu.clock.4MHz_internal=Internal 4 MHz
48.menu.clock.4MHz_internal.upload.speed=9600
48.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
48.menu.clock.4MHz_internal.build.f_cpu=4000000L

48.menu.clock.2MHz_internal=Internal 2 MHz
48.menu.clock.2MHz_internal.upload.speed=9600
48.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
48.menu.clock.2MHz_internal.build.f_cpu=2000000L

48.menu.clock.1MHz_internal=Internal 1 MHz
48.menu.clock.1MHz_internal.upload.speed=9600
48.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
48.menu.clock.1MHz_internal.build.clkpr=
48.menu.clock.1MHz_internal.build.f_cpu=1000000L


###################
#### ATmega8/A ####
###################

# General
8.name=ATmega8
8.upload.tool=avrdude
8.upload.maximum_data_size=1024
8.bootloader.tool=avrdude
8.bootloader.unlock_bits=0xff
8.bootloader.lock_bits=0xff
8.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
8.bootloader.high_fuses=0b110{bootloader.ckopt_bit}{bootloader.eesave_bit}111
8.build.core=MCUdude_corefiles
8.build.variant=standard
8.build.board=AVR_ATmega8
8.build.mcu=atmega8
8.build.bootloader_led=led+b5

# Upload port select
8.menu.bootloader.uart0=Yes (UART0)
8.menu.bootloader.uart0.upload.maximum_size=7808
8.menu.bootloader.uart0.upload.protocol=urclock
8.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
8.menu.bootloader.uart0.build.export_merged_output=true
8.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

8.menu.bootloader.no_bootloader=No bootloader
8.menu.bootloader.no_bootloader.upload.maximum_size=8192
8.menu.bootloader.no_bootloader.build.export_merged_output=false
8.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
8.menu.eeprom.keep=EEPROM retained
8.menu.eeprom.keep.bootloader.eesave_bit=0
8.menu.eeprom.erase=EEPROM not retained
8.menu.eeprom.erase.bootloader.eesave_bit=1

# Brown out detection - This is the first part of the low fuse bit concatenation
8.menu.BOD.2v7=BOD 2.7V
8.menu.BOD.2v7.bootloader.bod_bits=10
8.menu.BOD.4v0=BOD 4.0V
8.menu.BOD.4v0.bootloader.bod_bits=00
8.menu.BOD.disabled=BOD disabled
8.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
8.menu.LTO.Os_flto=LTO enabled
8.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
8.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
8.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
8.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

8.menu.LTO.Os=LTO disabled
8.menu.LTO.Os.compiler.c.extra_flags=
8.menu.LTO.Os.compiler.c.elf.extra_flags=
8.menu.LTO.Os.compiler.cpp.extra_flags=
8.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
8.menu.clock.16MHz_external=External 16 MHz
8.menu.clock.16MHz_external.upload.speed=115200
8.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.16MHz_external.bootloader.ckopt_bit=0
8.menu.clock.16MHz_external.build.f_cpu=16000000L

8.menu.clock.20MHz_external=External 20 MHz
8.menu.clock.20MHz_external.upload.speed=115200
8.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.20MHz_external.bootloader.ckopt_bit=0
8.menu.clock.20MHz_external.build.f_cpu=20000000L

8.menu.clock.18_432MHz_external=External 18.432 MHz
8.menu.clock.18_432MHz_external.upload.speed=115200
8.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
8.menu.clock.18_432MHz_external.build.f_cpu=18432000L

